basic/controllers/SiteController.php

SELECT * FROM `mi_frames` WHERE `id`=1
---
    public function actionFrames2() {
        $result = [];
        $input = file_get_contents('php://input');
        if( !empty($input) ) {
            $content = JSON::decode($input);
            $id = (int)$content['id'];
            $model = ($id === 0)
                ? new Frames()
                : Frames::find()->where(['id' => $id])->one();