basic/controllers/SiteController.php

    protected function _frameScripts($frame_id) {
        return (new \yii\db\Query())
                ->select('fj.id, fj.frame_id, fj.path, fj.name, fj.description, fj.position, fj.type')
                ->from('{{%frame_js}} fj')
                ->where('fj.frame_id = :id', [':id'=>$frame_id])
                ->all();
---
SELECT `f`.`id`, `f`.`name`, `f`.`description`, `f`.`path` FROM `mi_frames` `f` WHERE `id`=1